
**Terraform Cloud Plan Output**



<details><summary>Show Plan(infra/aws/prod)</summary>

```

[command]/home/runner/work/_temp/f67de263-e66c-4800-8fb0-cada6a98f475/terraform-bin plan -no-color
2024-04-28T12:39:00.894Z [INFO]  Terraform version: 1.8.1
2024-04-28T12:39:00.894Z [INFO]  Go runtime version: go1.22.1
2024-04-28T12:39:00.894Z [INFO]  CLI args: []string{"/home/runner/work/_temp/f67de263-e66c-4800-8fb0-cada6a98f475/terraform-bin", "plan", "-no-color"}
2024-04-28T12:39:00.895Z [INFO]  CLI command args: []string{"plan", "-no-color"}
2024-04-28T12:39:00.898Z [INFO]  backend-s3.aws-base: Retrieved credentials: tf_backend.operation=Configure tf_backend.req_id=a32270ed-8e73-7cb0-7e57-50f7fb2ddbb3 tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate tf_aws.credentials_source=EnvConfigCredentials
2024-04-28T12:39:01.678Z [INFO]  backend-s3.aws-base: Retrieved caller identity from STS: tf_backend.operation=Configure tf_backend.req_id=a32270ed-8e73-7cb0-7e57-50f7fb2ddbb3 tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate
2024-04-28T12:39:01.860Z [INFO]  backend-s3.aws-base: Retrieved caller identity from STS: tf_backend.operation=Configure tf_backend.req_id=a32270ed-8e73-7cb0-7e57-50f7fb2ddbb3 tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate
2024-04-28T12:39:02.197Z [INFO]  backend/local: starting Plan operation
2024-04-28T12:39:02.797Z [INFO]  backend-s3: Downloading remote state: tf_backend.operation=Get tf_backend.req_id=bac64d1c-37c5-09f7-f5c0-e7c6ad1e4482 tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate
2024-04-28T12:39:02.986Z [INFO]  provider: configuring client automatic mTLS
2024-04-28T12:39:03.079Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: configuring server automatic mTLS: timestamp=2024-04-28T12:39:03.079Z
2024-04-28T12:39:03.747Z [INFO]  provider: configuring client automatic mTLS
2024-04-28T12:39:03.832Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: configuring server automatic mTLS: timestamp=2024-04-28T12:39:03.832Z
2024-04-28T12:39:03.951Z [INFO]  backend/local: plan calling Plan
2024-04-28T12:39:03.951Z [INFO]  provider: configuring client automatic mTLS
2024-04-28T12:39:04.037Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: configuring server automatic mTLS: timestamp=2024-04-28T12:39:04.036Z
2024-04-28T12:39:04.146Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: Retrieved credentials: tf_rpc=ConfigureProvider tf_aws.credentials_source=EnvConfigCredentials tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=5b9c4ac8-6bb7-df10-b407-5118ba715161 @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.52/logging/tf_logger.go:39 @module=aws.aws-base tf_mux_provider="*schema.GRPCProviderServer" timestamp=2024-04-28T12:39:04.146Z
2024-04-28T12:39:04.908Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: Retrieved caller identity from STS: @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.52/logging/tf_logger.go:39 @module=aws.aws-base tf_mux_provider="*schema.GRPCProviderServer" tf_req_id=5b9c4ac8-6bb7-df10-b407-5118ba715161 tf_rpc=ConfigureProvider tf_provider_addr=registry.terraform.io/hashicorp/aws timestamp=2024-04-28T12:39:04.908Z
2024-04-28T12:39:04.917Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_ecr_repository.algosolved_repository, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .image_tag_mutability: planned value cty.StringVal("MUTABLE") for a non-computed attribute
2024-04-28T12:39:04.925Z [INFO]  backend/local: plan operation completed

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecr_repository.algosolved_repository will be created
  + resource "aws_ecr_repository" "algosolved_repository" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "algosolved"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = {
          + "Name"  = "algosolved"
          + "Stage" = "prod"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # aws_ecr_repository.algosolved_repository will be created%0A  + resource "aws_ecr_repository" "algosolved_repository" {%0A      + arn                  = (known after apply)%0A      + id                   = (known after apply)%0A      + image_tag_mutability = "MUTABLE"%0A      + name                 = "algosolved"%0A      + registry_id          = (known after apply)%0A      + repository_url       = (known after apply)%0A      + tags_all             = {%0A          + "Name"  = "algosolved"%0A          + "Stage" = "prod"%0A        }%0A    }%0A%0APlan: 1 to add, 0 to change, 0 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ANote: You didn't use the -out option to save this plan, so Terraform can't%0Aguarantee to take exactly these actions if you run "terraform apply" now.%0A
::debug::stderr: 2024-04-28T12:39:00.894Z [INFO]  Terraform version: 1.8.1%0A2024-04-28T12:39:00.894Z [INFO]  Go runtime version: go1.22.1%0A2024-04-28T12:39:00.894Z [INFO]  CLI args: []string{"/home/runner/work/_temp/f67de263-e66c-4800-8fb0-cada6a98f475/terraform-bin", "plan", "-no-color"}%0A2024-04-28T12:39:00.895Z [INFO]  CLI command args: []string{"plan", "-no-color"}%0A2024-04-28T12:39:00.898Z [INFO]  backend-s3.aws-base: Retrieved credentials: tf_backend.operation=Configure tf_backend.req_id=a32270ed-8e73-7cb0-7e57-50f7fb2ddbb3 tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate tf_aws.credentials_source=EnvConfigCredentials%0A2024-04-28T12:39:01.678Z [INFO]  backend-s3.aws-base: Retrieved caller identity from STS: tf_backend.operation=Configure tf_backend.req_id=a32270ed-8e73-7cb0-7e57-50f7fb2ddbb3 tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate%0A2024-04-28T12:39:01.860Z [INFO]  backend-s3.aws-base: Retrieved caller identity from STS: tf_backend.operation=Configure tf_backend.req_id=a32270ed-8e73-7cb0-7e57-50f7fb2ddbb3 tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate%0A2024-04-28T12:39:02.197Z [INFO]  backend/local: starting Plan operation%0A2024-04-28T12:39:02.797Z [INFO]  backend-s3: Downloading remote state: tf_backend.operation=Get tf_backend.req_id=bac64d1c-37c5-09f7-f5c0-e7c6ad1e4482 tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate%0A2024-04-28T12:39:02.986Z [INFO]  provider: configuring client automatic mTLS%0A2024-04-28T12:39:03.079Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: configuring server automatic mTLS: timestamp=2024-04-28T12:39:03.079Z%0A2024-04-28T12:39:03.747Z [INFO]  provider: configuring client automatic mTLS%0A2024-04-28T12:39:03.832Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: configuring server automatic mTLS: timestamp=2024-04-28T12:39:03.832Z%0A2024-04-28T12:39:03.951Z [INFO]  backend/local: plan calling Plan%0A2024-04-28T12:39:03.951Z [INFO]  provider: configuring client automatic mTLS%0A2024-04-28T12:39:04.037Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: configuring server automatic mTLS: timestamp=2024-04-28T12:39:04.036Z%0A2024-04-28T12:39:04.146Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: Retrieved credentials: tf_rpc=ConfigureProvider tf_aws.credentials_source=EnvConfigCredentials tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=5b9c4ac8-6bb7-df10-b407-5118ba715161 @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.52/logging/tf_logger.go:39 @module=aws.aws-base tf_mux_provider="*schema.GRPCProviderServer" timestamp=2024-04-28T12:39:04.146Z%0A2024-04-28T12:39:04.908Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: Retrieved caller identity from STS: @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.52/logging/tf_logger.go:39 @module=aws.aws-base tf_mux_provider="*schema.GRPCProviderServer" tf_req_id=5b9c4ac8-6bb7-df10-b407-5118ba715161 tf_rpc=ConfigureProvider tf_provider_addr=registry.terraform.io/hashicorp/aws timestamp=2024-04-28T12:39:04.908Z%0A2024-04-28T12:39:04.917Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_ecr_repository.algosolved_repository, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .image_tag_mutability: planned value cty.StringVal("MUTABLE") for a non-computed attribute%0A2024-04-28T12:39:04.925Z [INFO]  backend/local: plan operation completed%0A
::debug::exitcode: 0

```

</details>




**Pusher: @rha6780**